<a href="https://colab.research.google.com/github/ludawg44/jigsawlabs/blob/master/31Mar20_0_exploring_data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Exploring Data

### Introduction

Now that we know how to work with a dataframe and select individual columns, it's time for us to see if we can begin to understand our data.

Remember that as data scientists, we sometimes won't know where our data comes from.

> For example, in our movies datasets, are we looking at all of the movies, or all of the movies from a certain time period?  

The answer to these questions will have an impact on how we interpret our results.

### Exploring a DataFrame

So let's get a better sense of the data in our 538 moves dataset.  The first thing we'll do is load up the data, and then perhaps look at the columns available.

In [0]:
import pandas as pd
url = "https://raw.githubusercontent.com/jigsawlabs-student/exploring-pandas/master/imdb_movies.csv"
movies_df = pd.read_csv(url)

In [0]:
movies_df.columns

Index(['title', 'genre', 'budget', 'runtime', 'year', 'month', 'revenue'], dtype='object')

It may be difficult to understand what information is in these columns so perhaps we want to look at some of the initial values, which we can do with the `head` or `tail` methods.

In [0]:
movies_df.head(2)

                                      title      genre  ...  month     revenue
0                                    Avatar     Action  ...     12  2787965087
1  Pirates of the Caribbean: At World's End  Adventure  ...      5   961000000

[2 rows x 7 columns]

In [0]:
movies_df.tail(2)

                                           title    genre  ...  month   revenue
1998                                    Joy Ride      NaN  ...     10  36642838
1999  The Adventurer: The Curse of the Midas Box  Fantasy  ...     12      6399

[2 rows x 7 columns]

Or we can sample from a dataframe with the following.

In [0]:
movies_df.sample(3)

                                  title   genre    budget  ...  year  month  revenue
1511  Dreamer: Inspired By a True Story   Drama         0  ...  2005      9        0
1738                             Kundun   Drama  28000000  ...  1997     12  5684789
1109                      Heaven's Gate  Action  44000000  ...  1980     11  3484331

[3 rows x 7 columns]

### Viewing Sample Statistics

In pandas, we can view sample statistics either on a column or across a dataframe.

For example, we can look at the mean budget in the dataset.

In [0]:
movies_df.budget.mean()

60436856.172

Or we can look at the mean across our numeric columns.

In [0]:
movies_df.select_dtypes(exclude = 'object').mean()

budget     6.043686e+07
runtime    1.132675e+02
year       2.004427e+03
month      7.044000e+00
revenue    1.643506e+08
dtype: float64

Now if we want to get an overview of the data in each of the columns, we can do so with the describe method.

In [0]:
movies_df.describe()

             budget      runtime        year        month       revenue
count  2.000000e+03  2000.000000  2000.00000  2000.000000  2.000000e+03
mean   6.043686e+07   113.267500  2004.42650     7.044000  1.643506e+08
std    4.692045e+07    21.073728     7.95319     3.398947  2.186816e+08
min    0.000000e+00     0.000000  1940.00000     1.000000  0.000000e+00
25%    3.000000e+07    98.000000  2000.00000     4.000000  3.103408e+07
50%    4.800000e+07   110.000000  2005.00000     7.000000  9.400000e+07
75%    7.500000e+07   125.000000  2011.00000    10.000000  2.026695e+08
max    3.800000e+08   254.000000  2016.00000    12.000000  2.787965e+09

As we can see, this shows us the `mean` (that is, the average), and the standard deviation (which we'll describe later), as well as the range and percentiles.

> We can see even more information with `movies_df.describe(include = 'all')`.

In [0]:
movies_df.describe(include='all')

                   title   genre  ...        month       revenue
count               2000    1916  ...  2000.000000  2.000000e+03
unique              2000      11  ...          NaN           NaN
top     We Own the Night  Action  ...          NaN           NaN
freq                   1     483  ...          NaN           NaN
mean                 NaN     NaN  ...     7.044000  1.643506e+08
std                  NaN     NaN  ...     3.398947  2.186816e+08
min                  NaN     NaN  ...     1.000000  0.000000e+00
25%                  NaN     NaN  ...     4.000000  3.103408e+07
50%                  NaN     NaN  ...     7.000000  9.400000e+07
75%                  NaN     NaN  ...    10.000000  2.026695e+08
max                  NaN     NaN  ...    12.000000  2.787965e+09

[11 rows x 7 columns]

For example, we can see that our movie years range from 1970 to 2013, and that the minimum budget value is 7000.

Viewing a histogram of the data.  For a single column, we can view a histogram of the data with the `value_counts` method.

In [0]:
movies_df['genre'].value_counts()

Action             483
Drama              365
Comedy             359
Adventure          236
Animation           93
Fantasy             80
Crime               76
Thriller            73
Horror              59
Science Fiction     52
Romance             40
Name: genre, dtype: int64

But this method is not available across a dataframe.

### Summary

In this lesson, we learned some basic methods for exploring data.  We saw how to get an overview of the data in an entire dataframe with the `head`, `tail`, `columns` and `describe` method.

Then we saw how we can focus in on individual columns by plotting our data with the `plot` method, or calling `describe` on a single column, or by using the `value_counts` method.